app/controllers/home_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."name" IS NULL LIMIT 1
---
  def login
    @user = User.all
    @current_user = User.all
    nick = params[:nick]
    user = User.find_by name:  nick