app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT "photos".* FROM "photos"

  def new
    @photo = Photo.new
    user_id = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]

   def add_photo
    user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @user = :user_id
    print 'PARAMETROS =======>     '
    print current_user.id
    #print 'ESTE ES EL USUARIO' + String(@add_photo_user_id.id)
    #@photo = Photo.create(photo_params, user_id: @user.id)
    #@photo = user.photos.create(photo_params)
    @photo = Photo.create(order_date: Time.now, customer_id: @user.id)
---
INSERT INTO "photos" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Mon, 03 Mar 2014 19:00:21 UTC +00:00], ["title", "alf"], ["updated_at", Mon, 03 Mar 2014 19:00:21 UTC +00:00], ["url", "alf2.jpg"]]

    def set_photo
      @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "add_photo"]]