app/controllers/users_controller.rb

SELECT "photos".* FROM "photos" ORDER BY "photos".updated_at DESC LIMIT 1
---
  def show
    @photos = Photo.all

INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "name", "password_digest", "photo", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "remember_token" = ?, "updated_at" = ? WHERE "users"."id" = 4  [["remember_token", "d145c388e8471c1f5f15039af6d242b33fa6f29d"], ["updated_at", Thu, 24 Apr 2014 11:33:29 UTC +00:00]]
---
  def create
    print 'Creando usuario ==> '
    print user_params
    @user = User.create(user_params)
    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def destroy
    @user.destroy